---
kind: method
id: M:Autodesk.Revit.DB.CurtainGrid.GetUnlockedMullionIds
source: html/032f13a6-311d-f4e1-53ff-b3c345fd043b.htm
---
# Autodesk.Revit.DB.CurtainGrid.GetUnlockedMullionIds Method

Gets all ElementIds of the unlocked mullions of the curtain grid.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetUnlockedMullionIds()
```

## Returns
The unlocked mullion ElementIds

## Remarks
ElementIds are of Mullion Elements.